// from: 西瓜小说 .exploreUrl
sort=[];
push=(title,url,type)=>sort.push({
		title: title,
		url: url,
		style: {
				layout_flexGrow: 1,
				layout_flexBasisPercent: type
			}
	});
$$=(flag,cid,tid,status)=>`@js:
uid = 1166;
body = {
	flag: ${flag},
	size: 15,
	index: page,
	sort: 1,
	tid: "${tid}",
	status: "${status}",
	cid: ${cid}
}
eval(String(source.bookSourceComment));`;
[
["男",[
["都市",70,[
["乡土生活",538],
["都市生活",539],
["古玩鉴宝",540],
["明星仕商",541],
["异术超能",543],
["高手激战",545],
["医道圣手",546],
["风水玄术",548]
]],
["玄幻",64,[
["东方玄幻",512],
["异世大陆",513],
["斗气世界",514],
["王朝争霸",515]
]],
["仙侠",65,[
["古典仙侠",516],
["奇幻修真",517],
["洪荒封神",518],
["现代修真",519]
]],
["历史",69,[
["上古先秦",531],
["两宋元明",532],
["两晋隋唐",533],
["架空历史",535],
["清史民国",536],
["秦汉三国",537]
]],
["悬疑",86,[
["原创灵异",606],
["悬疑推理",607]
]],
["科幻",67,[
["时空穿梭",522],
["星际战争",523],
["未来世界",524],
["变异末世",525],
["机甲科技",526]
]],
["游戏",73,[
["游戏生涯",554],
["虚拟网游",555]
]]
]],

["女",[
["现代言情",83,[
["总裁豪门",577],
["都市纯爱",578],
["重生甜宠",579],
["年代文",838]
]],
["古代言情",85,[
["古色古香",585],
["女尊女强",586],
["重生逆袭",587],
["宫斗宅斗",588],
["清穿民国",589],
["种田经商",590],
["穿越时空",591]
]],
["幻想言情",84,[
["仙侠幻情",581],
["魔法异界",584]
]],
["青春校园",82,[
["贵族学院",575],
["青春纯爱",576]
]],
["快穿次元",79,[
["快穿次元",611]
]]
]]].map([title,list]=>{
		push('༺ˇ»`ʚ'+title+'生频道ɞ´«ˇ༻',null,1);
		list.map([title,cid,list]=>{
				flag = 1;
				push('༺ '+title+' ༻',$$(flag,cid,"",""),1);
				list.map([title,tid]=>{
						flag = 0;
						["["+title+"]","完结","连载"].map((title,status)=>{
								status = status?status-1:"";
								push(title,$$(flag,cid,tid,status),0.25);
							});
					});
			});
	});
JSON.stringify(sort);
