// from: 免费追书 .exploreUrl
//选择需要开启的分类，默认开启男频
//男频 0,1,2,3,4,5,6,7
//女频 8,9,10,11,12,13

开启的分类 = "0,1,2,3,4,5,6,7"
//开启的分类 = "8,9,10,11,12,13"

//完结|连载id
完结分类 = "3"
连载分类 = "1"
//一行个数
var nums = 3 ;
//分隔符
var separator = '::'

//标题::链接::一行个数::分类

      分类 = ["都市","东方玄幻","武侠仙侠","悬疑惊悚","架空历史","网游竞技","科幻未来","西方玄幻","总裁豪门","古代言情","幻想言情","现代言情","青春校园","唯美同人"]
      
      都市连载=["热血都市::1201::::w","异术超能::1202::::w","官场职场::1203::::w"]
      都市完结=["热血都市::1201::::w","异术超能::1202::::w","官场职场::1203::::w"]
    
	     东方玄幻连载=["玄幻大陆::1101::::w","洪荒传说::1102::::w","异界时空::1103::::w"]
      东方玄幻完结=["玄幻大陆::1101::::w","洪荒传说::1102::::w","异界时空::1103::::w"]
	
	    武侠仙侠连载=["奇幻修真::1401::::w","武侠国术::1402::::w","古典仙侠::1403::::w"]
	    武侠仙侠完结=["奇幻修真::1401::::w","武侠国术::1402::::w","古典仙侠::1403::::w"]
	    
	    悬疑惊悚连载=["悬疑冒险::1801::::w","恐怖惊悚::1802::::w","推理侦探::1803::::w"]
	    悬疑惊悚完结=["悬疑冒险::1801::::w","恐怖惊悚::1802::::w","推理侦探::1803::::w"]
	    
	    架空历史连载=["架空王朝::1501::::w","历史传记::1502::::w","战争幻想::1503::::w"]
	    架空历史完结=["架空王朝::1501::::w","历史传记::1502::::w","战争幻想::1503::::w"]
	    
	    网游竞技连载=["虚拟游戏::1701::::w","游戏异界::1702::::w","竞技小说::1703::::w"]
	    网游竞技完结=["虚拟游戏::1701::::w","游戏异界::1702::::w","竞技小说::1703::::w"]
	    
	    科幻未来连载=["星际未来::1601::::w","进化变异::1602::::w","末世危机::1603::::w"]
	    科幻未来完结=["星际未来::1601::::w","进化变异::1602::::w","末世危机::1603::::w"]
	    
	    西方玄幻连载=["魔幻世界::1301::::w","大陆争霸::1302::::w","异类兽族::1303::::w"]
	    西方玄幻完结=["魔幻世界::1301::::w","大陆争霸::1302::::w","异类兽族::1303::::w"]
	    
	    
	    总裁豪门连载=["豪门世家::2401::::w","娱乐明星::2402::::w"]
	    总裁豪门完结=["豪门世家::2401::::w","娱乐明星::2402::::w"]
	    古代言情连载=["古色古香::2101::::w","穿越架空::2102::::w","宫闱宅斗::2103::::w"]
	    古代言情完结=["古色古香::2101::::w","穿越架空::2102::::w","宫闱宅斗::2103::::w"]
	    幻想言情连载=["玄幻仙侠::2201::::w","异族恋情::2202::::w","魔幻精灵::2203::::w"]
	    幻想言情完结=["玄幻仙侠::2201::::w","异族恋情::2202::::w","魔幻精灵::2203::::w"]
	    现代言情连载=["婚恋情缘::2301::::w","商战职场::2302::::w","民国风情::2303::::w"]
	    现代言情完结=["婚恋情缘::2301::::w","商战职场::2302::::w","民国风情::2303::::w"]
	    青春校园连载=["校园纯情::2501::::w","青涩年华::2502::::w"]
	    青春校园完结=["校园纯情::2501::::w","青涩年华::2502::::w"]
	    唯美同人连载=["唯美小说::2601::::w","同人小说::2602::::w"]
	    唯美同人完结=["唯美小说::2601::::w","同人小说::2602::::w"]
	    
//分类生成
	function parse(data,y){
	let args=data.split(separator);
	let title = args[0],url=args[1],num=nums;
	  try {num = args[2] }catch(e){}
	  try {tag = args[3];
u=tag=="w"?'https://cxb-pro.cread.com/cx/new/catelistnew?uid=127995117&cnid=10013&version=8.1.4&flid='+parseInt(url/10)*10+'&thirdCateId='+url+'&sortType=1&bookStatus='+y+'&wordnumType=0&pageSize=20&curpage={{page}}':y;
 }catch(e){}
	return [title, u, num]
	}
	
	
function FlexBox(title, url, num){
	let obj={};
		 obj.style={},obj.title=title,obj.url=url?url:'',obj.style['layout_flexGrow']=1;
		 
		 
	//数值设定
	let data={1:1,2:0.4,3:0.25,4:0.2,5:0.15,7:0.1,10:0.05};
obj.style['layout_flexBasisPercent']=data[num]
		return obj
		}
		
		分类list = 开启的分类.split(",")

var 分类result = [];
	
  var i=0;
	 if(分类list[i]<=7){
["🔖男频🔖"].forEach(x=>{
		 分类result.push(FlexBox.apply(null,parse(x)))
		})
}
   else if(分类list[i]>=8){
	["🔖女频🔖"].forEach(x=>{
		 分类result.push(FlexBox.apply(null,parse(x)))
		})
		}
	
			
for(i in 分类list){
	 分类result.push(FlexBox.apply(null,parse(分类[分类list[i]]+"🍁连载🔖::::1")))
	a = eval(分类[分类list[i]]+"连载");
	a.forEach(x=>{
		 分类result.push(FlexBox.apply(null,parse(x,连载分类)))
		})
		
	 分类result.push(FlexBox.apply(null,parse(分类[分类list[i]]+"🍁完结🔖::::1")))
	b = eval(分类[分类list[i]]+"完结");
	b.forEach(x=>{
		 分类result.push(FlexBox.apply(null,parse(x,完结分类)))
		})
	}
JSON.stringify(分类result)
